results/r6g-a_write.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 64 tps: 4801.73 qps: 28825.59 (r/w/o: 0.00/19216.98/9608.61) lat (ms,95%): 19.65 err/s: 2.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 5139.96 qps: 30850.50 (r/w/o: 0.00/20568.93/10281.57) lat (ms,95%): 17.63 err/s: 1.60 reconn/s: 0.00
[ 60s ] thds: 64 tps: 5189.57 qps: 31137.24 (r/w/o: 0.00/20756.70/10380.55) lat (ms,95%): 16.71 err/s: 1.45 reconn/s: 0.00
[ 80s ] thds: 64 tps: 5266.48 qps: 31608.11 (r/w/o: 0.00/21073.31/10534.80) lat (ms,95%): 16.41 err/s: 1.80 reconn/s: 0.00
[ 100s ] thds: 64 tps: 5387.65 qps: 32324.33 (r/w/o: 0.00/21546.92/10777.41) lat (ms,95%): 16.12 err/s: 2.15 reconn/s: 0.00
[ 120s ] thds: 64 tps: 5357.84 qps: 32158.92 (r/w/o: 0.00/21441.54/10717.37) lat (ms,95%): 15.55 err/s: 1.85 reconn/s: 0.00
[ 140s ] thds: 64 tps: 5358.14 qps: 32153.54 (r/w/o: 0.00/21434.86/10718.68) lat (ms,95%): 15.55 err/s: 2.20 reconn/s: 0.00
[ 160s ] thds: 64 tps: 5373.47 qps: 32248.17 (r/w/o: 0.00/21499.38/10748.79) lat (ms,95%): 15.55 err/s: 1.85 reconn/s: 0.00
[ 180s ] thds: 64 tps: 5415.15 qps: 32496.48 (r/w/o: 0.00/21664.18/10832.29) lat (ms,95%): 16.41 err/s: 2.00 reconn/s: 0.00
[ 200s ] thds: 64 tps: 5436.24 qps: 32622.95 (r/w/o: 0.00/21748.62/10874.33) lat (ms,95%): 15.55 err/s: 1.85 reconn/s: 0.00
[ 220s ] thds: 64 tps: 5461.61 qps: 32776.20 (r/w/o: 0.00/21850.69/10925.52) lat (ms,95%): 15.55 err/s: 2.30 reconn/s: 0.00
[ 240s ] thds: 64 tps: 5450.56 qps: 32694.56 (r/w/o: 0.00/21793.04/10901.52) lat (ms,95%): 16.71 err/s: 1.95 reconn/s: 0.00
[ 260s ] thds: 64 tps: 5442.16 qps: 32672.03 (r/w/o: 0.00/21784.46/10887.58) lat (ms,95%): 15.83 err/s: 1.70 reconn/s: 0.00
[ 280s ] thds: 64 tps: 5389.22 qps: 32341.20 (r/w/o: 0.00/21560.65/10780.55) lat (ms,95%): 15.83 err/s: 2.10 reconn/s: 0.00
[ 300s ] thds: 64 tps: 5464.30 qps: 32788.45 (r/w/o: 0.00/21858.10/10930.35) lat (ms,95%): 15.55 err/s: 1.75 reconn/s: 0.00
[ 320s ] thds: 64 tps: 5366.06 qps: 32194.30 (r/w/o: 0.00/21460.64/10733.67) lat (ms,95%): 15.83 err/s: 1.55 reconn/s: 0.00
[ 340s ] thds: 64 tps: 5483.84 qps: 32915.60 (r/w/o: 0.00/21946.47/10969.13) lat (ms,95%): 15.55 err/s: 1.45 reconn/s: 0.00
[ 360s ] thds: 64 tps: 5445.35 qps: 32676.95 (r/w/o: 0.00/21784.55/10892.40) lat (ms,95%): 16.41 err/s: 1.70 reconn/s: 0.00
[ 380s ] thds: 64 tps: 5477.50 qps: 32870.35 (r/w/o: 0.00/21913.35/10957.00) lat (ms,95%): 16.41 err/s: 2.00 reconn/s: 0.00
[ 400s ] thds: 64 tps: 5434.43 qps: 32600.88 (r/w/o: 0.00/21730.77/10870.11) lat (ms,95%): 15.55 err/s: 1.25 reconn/s: 0.00
[ 420s ] thds: 64 tps: 5475.91 qps: 32869.69 (r/w/o: 0.00/21915.81/10953.88) lat (ms,95%): 15.83 err/s: 2.05 reconn/s: 0.00
[ 440s ] thds: 64 tps: 5421.09 qps: 32530.87 (r/w/o: 0.00/21686.70/10844.17) lat (ms,95%): 17.01 err/s: 2.00 reconn/s: 0.00
[ 460s ] thds: 64 tps: 5476.43 qps: 32866.28 (r/w/o: 0.00/21911.47/10954.81) lat (ms,95%): 16.12 err/s: 1.95 reconn/s: 0.00
[ 480s ] thds: 64 tps: 5449.19 qps: 32701.39 (r/w/o: 0.00/21800.76/10900.63) lat (ms,95%): 16.12 err/s: 2.25 reconn/s: 0.00
[ 500s ] thds: 64 tps: 5447.10 qps: 32688.60 (r/w/o: 0.00/21792.40/10896.20) lat (ms,95%): 16.41 err/s: 2.00 reconn/s: 0.00
[ 520s ] thds: 64 tps: 5605.91 qps: 33634.49 (r/w/o: 0.00/22421.01/11213.48) lat (ms,95%): 15.55 err/s: 1.65 reconn/s: 0.00
[ 540s ] thds: 64 tps: 5495.92 qps: 32986.08 (r/w/o: 0.00/21992.59/10993.49) lat (ms,95%): 15.83 err/s: 1.65 reconn/s: 0.00
[ 560s ] thds: 64 tps: 5527.46 qps: 33170.93 (r/w/o: 0.00/22113.90/11057.03) lat (ms,95%): 15.27 err/s: 2.10 reconn/s: 0.00
[ 580s ] thds: 64 tps: 5533.50 qps: 33206.80 (r/w/o: 0.00/22137.75/11069.05) lat (ms,95%): 15.55 err/s: 2.05 reconn/s: 0.00
[ 600s ] thds: 64 tps: 5596.45 qps: 33585.15 (r/w/o: 0.00/22389.95/11195.20) lat (ms,95%): 15.83 err/s: 2.30 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           12975954
        other:                           6488080
        total:                           19464034
    transactions:                        3243475 (5405.20 per sec.)
    queries:                             19464034 (32436.48 per sec.)
    ignored errors:                      1130   (1.88 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0650s
    total number of events:              3243475

Latency (ms):
         min:                                    3.49
         avg:                                   11.84
         max:                                  178.85
         95th percentile:                       16.12
         sum:                             38396864.81

Threads fairness:
    events (avg/stddev):           50679.2969/239.24
    execution time (avg/stddev):   599.9510/0.01