results/r6g-b_read.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 32 tps: 16568.94 qps: 165696.08 (r/w/o: 165696.08/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 17232.37 qps: 172324.07 (r/w/o: 172324.07/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 18240.44 qps: 182404.32 (r/w/o: 182404.32/0.00/0.00) lat (ms,95%): 2.26 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 18611.96 qps: 186119.94 (r/w/o: 186119.94/0.00/0.00) lat (ms,95%): 2.18 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 19251.83 qps: 192519.65 (r/w/o: 192519.65/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 19294.43 qps: 192944.57 (r/w/o: 192944.57/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 32 tps: 19369.70 qps: 193695.53 (r/w/o: 193695.53/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 32 tps: 19230.99 qps: 192310.29 (r/w/o: 192310.29/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 32 tps: 19261.46 qps: 192613.19 (r/w/o: 192613.19/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 32 tps: 19228.14 qps: 192282.98 (r/w/o: 192282.98/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 32 tps: 19310.56 qps: 193104.40 (r/w/o: 193104.40/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 32 tps: 19293.52 qps: 192935.75 (r/w/o: 192935.75/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 32 tps: 19233.07 qps: 192330.23 (r/w/o: 192330.23/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 32 tps: 19224.29 qps: 192242.92 (r/w/o: 192242.92/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 32 tps: 19408.34 qps: 194083.86 (r/w/o: 194083.86/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 32 tps: 19440.95 qps: 194409.72 (r/w/o: 194409.72/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 32 tps: 19334.32 qps: 193343.03 (r/w/o: 193343.03/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 32 tps: 19298.02 qps: 192980.68 (r/w/o: 192980.68/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 32 tps: 19331.25 qps: 193311.25 (r/w/o: 193311.25/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 32 tps: 19287.59 qps: 192874.26 (r/w/o: 192874.26/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 32 tps: 19369.51 qps: 193697.40 (r/w/o: 193697.40/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 32 tps: 19414.73 qps: 194147.01 (r/w/o: 194147.01/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 32 tps: 19355.17 qps: 193551.63 (r/w/o: 193551.63/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 32 tps: 19414.87 qps: 194149.13 (r/w/o: 194149.13/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 32 tps: 19382.20 qps: 193823.06 (r/w/o: 193823.06/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 32 tps: 19350.27 qps: 193500.88 (r/w/o: 193500.88/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 32 tps: 19367.25 qps: 193673.22 (r/w/o: 193673.22/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 32 tps: 19423.00 qps: 194229.64 (r/w/o: 194229.64/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 32 tps: 19379.36 qps: 193793.58 (r/w/o: 193793.58/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 32 tps: 19375.57 qps: 193755.94 (r/w/o: 193755.94/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            114657420
        write:                           0
        other:                           0
        total:                           114657420
    transactions:                        11465742 (19109.21 per sec.)
    queries:                             114657420 (191092.10 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0101s
    total number of events:              11465742

Latency (ms):
         min:                                    0.97
         avg:                                    1.67
         max:                                  247.76
         95th percentile:                        2.14
         sum:                             19182652.75

Threads fairness:
    events (avg/stddev):           358304.4375/43756.39
    execution time (avg/stddev):   599.4579/0.06